# IntersectionResultArrayIterator Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
IntersectionResultArrayIterator Constructor
IntersectionResultArrayIterator Class See Also
---
For Internal Use Only.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public IntersectionResultArrayIterator()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
IntersectionResultArrayIterator()
```

# Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.
# See Also
IntersectionResultArrayIterator Class
Autodesk.Revit.DB Namespace